In [1]:
import pandas as pd
import pandas_datareader as pdr

In [2]:
import pandas as pd
data_url = 'http://bit.ly/2cLzoxH'
# read data from url as pandas dataframe
gapminder = pd.read_csv(data_url)
print(gapminder.head(3))

       country  year         pop continent  lifeExp   gdpPercap
0  Afghanistan  1952   8425333.0      Asia   28.801  779.445314
1  Afghanistan  1957   9240934.0      Asia   30.332  820.853030
2  Afghanistan  1962  10267083.0      Asia   31.997  853.100710

In [3]:
gapminder.continent == 'Africa'

0       False
1       False
2       False
3       False
4       False
        ...
1699     True
1700     True
1701     True
1702     True
1703     True
Name: continent, Length: 1704, dtype: bool

In [35]:
gapminder[gapminder.continent == 'Africa']

       country  year         pop continent  lifeExp    gdpPercap
24     Algeria  1952   9279525.0    Africa   43.077  2449.008185
25     Algeria  1957  10270856.0    Africa   45.685  3013.976023
26     Algeria  1962  11000948.0    Africa   48.303  2550.816880
27     Algeria  1967  12760499.0    Africa   51.407  3246.991771
28     Algeria  1972  14760787.0    Africa   54.518  4182.663766
...        ...   ...         ...       ...      ...          ...
1699  Zimbabwe  1987   9216418.0    Africa   62.351   706.157306
1700  Zimbabwe  1992  10704340.0    Africa   60.377   693.420786
1701  Zimbabwe  1997  11404948.0    Africa   46.809   792.449960
1702  Zimbabwe  2002  11926563.0    Africa   39.989   672.038623
1703  Zimbabwe  2007  12311143.0    Africa   43.487   469.709298

[624 rows x 6 columns]

In [5]:
gapminder[gapminder.continent == 'Africa'].shape

(624, 6)

In [16]:
gapminder.query('continent =="Africa"')

       country  year         pop continent  lifeExp    gdpPercap
24     Algeria  1952   9279525.0    Africa   43.077  2449.008185
25     Algeria  1957  10270856.0    Africa   45.685  3013.976023
26     Algeria  1962  11000948.0    Africa   48.303  2550.816880
27     Algeria  1967  12760499.0    Africa   51.407  3246.991771
28     Algeria  1972  14760787.0    Africa   54.518  4182.663766
...        ...   ...         ...       ...      ...          ...
1699  Zimbabwe  1987   9216418.0    Africa   62.351   706.157306
1700  Zimbabwe  1992  10704340.0    Africa   60.377   693.420786
1701  Zimbabwe  1997  11404948.0    Africa   46.809   792.449960
1702  Zimbabwe  2002  11926563.0    Africa   39.989   672.038623
1703  Zimbabwe  2007  12311143.0    Africa   43.487   469.709298

[624 rows x 6 columns]

In [7]:
df1 = gapminder[gapminder.continent == 'Africa']
df2 = gapminder.query('continent =="Africa"')
df1.equals(df2)

True

In [51]:
gapminder

          country  year         pop continent  lifeExp   gdpPercap
0     Afghanistan  1952   8425333.0      Asia   28.801  779.445314
1     Afghanistan  1957   9240934.0      Asia   30.332  820.853030
2     Afghanistan  1962  10267083.0      Asia   31.997  853.100710
3     Afghanistan  1967  11537966.0      Asia   34.020  836.197138
4     Afghanistan  1972  13079460.0      Asia   36.088  739.981106
...           ...   ...         ...       ...      ...         ...
1699     Zimbabwe  1987   9216418.0    Africa   62.351  706.157306
1700     Zimbabwe  1992  10704340.0    Africa   60.377  693.420786
1701     Zimbabwe  1997  11404948.0    Africa   46.809  792.449960
1702     Zimbabwe  2002  11926563.0    Africa   39.989  672.038623
1703     Zimbabwe  2007  12311143.0    Africa   43.487  469.709298

[1704 rows x 6 columns]

Third way to drop rows using a condition on column values is to use drop() function. This is a round about way and one first need to get the index numbers or index names. And then we can use drop function.

In [56]:
df = gapminder[gapminder.continent != 'Europe']
df = df[df.continent != 'Oceania']
df = df[df.continent != 'Americas']

In [57]:
df.drop(df.index)

Empty DataFrame
Columns: [country, year, pop, continent, lifeExp, gdpPercap]
Index: []

In [58]:
df.shape

(1020, 6)

In [40]:
#save dataframe in csv with date and time
with open("africaasia.csv", "+w") as file:
    df.to_csv(file, index=True, na_rep='NA')

In [41]:
africaasia= pd.read_csv('africaasia.csv')

In [42]:
africaasia

      Unnamed: 0      country  year         pop continent  lifeExp   gdpPercap
0              0  Afghanistan  1952   8425333.0      Asia   28.801  779.445314
1              1  Afghanistan  1957   9240934.0      Asia   30.332  820.853030
2              2  Afghanistan  1962  10267083.0      Asia   31.997  853.100710
3              3  Afghanistan  1967  11537966.0      Asia   34.020  836.197138
4              4  Afghanistan  1972  13079460.0      Asia   36.088  739.981106
...          ...          ...   ...         ...       ...      ...         ...
1015        1699     Zimbabwe  1987   9216418.0    Africa   62.351  706.157306
1016        1700     Zimbabwe  1992  10704340.0    Africa   60.377  693.420786
1017        1701     Zimbabwe  1997  11404948.0    Africa   46.809  792.449960
1018        1702     Zimbabwe  2002  11926563.0    Africa   39.989  672.038623
1019        1703     Zimbabwe  2007  12311143.0    Africa   43.487  469.709298

[1020 rows x 7 columns]

In [59]:
date_string = '2019-04-17'
time_stamp = pd.to_datetime(date_string)
date_time = time_stamp.date()

In [66]:
df= pd.read_csv('../data/intraday_30min_EURCHF=X.csv') 
import time
import datetime

In [68]:

df['timestamp'].str.strip('T00:00:00')

0       2019-06-17 06:55:2
1          2019-06-17 06:3
2            2019-06-17 06
3          2019-06-17 05:3
4            2019-06-17 05
               ...
1396       2019-05-06 21:3
1397         2019-05-06 21
1398       2019-05-06 20:3
1399          2019-05-06 2
1400       2019-05-06 19:3
Name: timestamp, Length: 1401, dtype: object

In [69]:
df

                timestamp    open    high     low   close  volume
0     2019-06-17 06:55:20  1.1210  1.1210  1.1202  1.1207       0
1     2019-06-17 06:30:00  1.1209  1.1210  1.1200  1.1210       0
2     2019-06-17 06:00:00  1.1205  1.1210  1.1200  1.1209       0
3     2019-06-17 05:30:00  1.1209  1.1210  1.1200  1.1205       0
4     2019-06-17 05:00:00  1.1203  1.1209  1.1198  1.1208       0
...                   ...     ...     ...     ...     ...     ...
1396  2019-05-06 21:30:00  1.1392  1.1394  1.1387  1.1393       0
1397  2019-05-06 21:00:00  1.1393  1.1395  1.1387  1.1392       0
1398  2019-05-06 20:30:00  1.1395  1.1395  1.1386  1.1393       0
1399  2019-05-06 20:00:00  1.1395  1.1397  1.1390  1.1395       0
1400  2019-05-06 19:30:00  1.1396  1.1397  1.1389  1.1395       0

[1401 rows x 6 columns]

In [71]:
str(df['timestamp'])

'0       2019-06-17 06:55:20\n1       2019-06-17 06:30:00\n2       2019-06-17 06:00:00\n3       2019-06-17 05:30:00\n4       2019-06-17 05:00:00\n               ...         \n1396    2019-05-06 21:30:00\n1397    2019-05-06 21:00:00\n1398    2019-05-06 20:30:00\n1399    2019-05-06 20:00:00\n1400    2019-05-06 19:30:00\nName: timestamp, Length: 1401, dtype: object'

In [74]:
str(df['timestamp'])[:-8]

'0       2019-06-17 06:55:20\n1       2019-06-17 06:30:00\n2       2019-06-17 06:00:00\n3       2019-06-17 05:30:00\n4       2019-06-17 05:00:00\n               ...         \n1396    2019-05-06 21:30:00\n1397    2019-05-06 21:00:00\n1398    2019-05-06 20:30:00\n1399    2019-05-06 20:00:00\n1400    2019-05-06 19:30:00\nName: timestamp, Length: 1401, dtype'

In [76]:
df['date'] = df['timestamp'].astype('datetime64[ns]')

In [77]:
df

,timestamp,open,high,low,close,volume,date
0,2019-06-17 06:55:20,1.1210,1.1210,1.1202,1.1207,0,2019-06-17 06:55:20
1,2019-06-17 06:30:00,1.1209,1.1210,1.1200,1.1210,0,2019-06-17 06:30:00
2,2019-06-17 06:00:00,1.1205,1.1210,1.1200,1.1209,0,2019-06-17 06:00:00
3,2019-06-17 05:30:00,1.1209,1.1210,1.1200,1.1205,0,2019-06-17 05:30:00
4,2019-06-17 05:00:00,1.1203,1.1209,1.1198,1.1208,0,2019-06-17 05:00:00
...,...,...,...,...,...,...,...
1396,2019-05-06 21:30:00,1.1392,1.1394,1.1387,1.1393,0,2019-05-06 21:30:00
1397,2019-05-06 21:00:00,1.1393,1.1395,1.1387,1.1392,0,2019-05-06 21:00:00
1398,2019-05-06 20:30:00,1.1395,1.1395,1.1386,1.1393,0,2019-05-06 20:30:00
1399,2019-05-06 20:00:00,1.1395,1.1397,1.1390,1.1395,0,2019-05-06 20:00:00
1400,2019-05-06 19:30:00,1.1396,1.1397,1.1389,1.1395,0,2019-05-06 19:30:00